In [1]:
import pandas as pd
import numpy as np

In [2]:
# 任务1：将列表转化为numpy数组
import numpy as np
data0 = [2,4,6.5,8]
arr0 = np.array(data0)

In [3]:
# 任务2：新建Pandas中的Series数据类型，打印出其大小，索引值，值

In [4]:
#pandas中的Series数据类型
s = pd.Series(data=[100, 'a', { 'dic1': 5 }],
              index=pd.Index(['id1', 20, 'third'], name='my_idx'),
              dtype='object',
              name='my_name')

In [5]:
s2 = pd.Series(["1","2","3","4","5"])

In [6]:
s2.index.values

array([0, 1, 2, 3, 4], dtype=int64)

In [7]:
type(s2.values[0])

str

In [8]:
s2.size

5

In [9]:
s2.shape[0]

5

In [10]:
#任务3：创建DataFrame类型的数据，并获取其索引，值及表大小
d = {
    "作者":pd.Series(['余华','残血','莫言']),
    "作品":pd.Series(['活着','暗夜','红高粱']),
    "价格":pd.Series([32,45,56]),
}
df = pd.DataFrame(d)

In [11]:
df.index.values

array([0, 1, 2], dtype=int64)

In [12]:
df.shape

(3, 3)

In [13]:
df.size

9

In [14]:
df['作品']

0     活着
1     暗夜
2    红高粱
Name: 作品, dtype: object

In [15]:
贵州茅台原始数据 = pd.read_csv(R'output\600519.csv')

In [16]:
#按列查询数据
贵州茅台原始数据['TURNOVER']

0        1410347008
1         463463008
2         194689000
3         177558000
4          86231000
           ...
4089     2694714080
4090    10663392512
4091     5239853056
4092     5581027328
4093     5227695104
Name: TURNOVER, Length: 4094, dtype: int64

In [17]:
#按照行索引
贵州茅台原始数据.loc[0]

day           2001-08-27
STOCK_CODE       6005191
open               34.51
close              35.55
maximum            37.78
minimum            32.85
volume            406318
TURNOVER      1410347008
Name: 0, dtype: object

In [18]:
贵州茅台 = 贵州茅台原始数据.set_index('day')

In [19]:
贵州茅台.loc['2001-08-27',['open','close']]

open     34.51
close    35.55
Name: 2001-08-27, dtype: float64

In [20]:
贵州茅台.loc['2008-10-22',['open','close']]

open     93.77
close    96.38
Name: 2008-10-22, dtype: float64

In [21]:
贵州茅台.loc['2001-08-27':'2001-10-08']

            STOCK_CODE   open  close  maximum  minimum  volume    TURNOVER
day
2001-08-27     6005191  34.51  35.55    37.78    32.85  406318  1410347008
2001-08-28     6005191  34.99  36.86    37.00    34.61  129647   463463008
2001-08-29     6005191  36.98  36.38    37.00    36.10   53252   194689000
2001-08-30     6005191  36.28  37.10    37.51    36.00   48013   177558000
2001-08-31     6005191  37.15  37.01    37.62    36.80   23231    86231000
2001-09-03     6005191  37.20  36.99    37.57    36.85   22112    82129000
2001-09-04     6005191  37.01  37.46    38.08    36.88   37006   139204000
2001-09-05     6005191  37.61  37.44    37.92    37.21   26066    97796000
2001-09-06     6005191  37.35  36.70    37.47    36.51   28997   107078000
2001-09-07     6005191  36.50  35.68    36.95    35.65   31552   113868000
2001-09-10     6005191  35.40  36.70    36.85    35.01   18878    68406000
2001-09-11     6005191  36.80  36.29    36.95    36.20   11390    41579000
2001-09-12     6005191  35.33  35.98    36.20    35.30   25045    89421000
2001-09-13     6005191  36.01  35.89    36.30    35.70   10986    39512000
2001-09-14     6005191  36.01  36.30    36.50    35.80    7672    27740000
2001-09-17     6005191  36.08  35.84    36.29    35.50    8983    32183000
2001-09-18     6005191  35.88  36.25    36.55    35.85   10773    39006000
2001-09-19     6005191  36.30  36.92    36.92    36.06    8650    31597000
2001-09-20     6005191  36.90  36.61    37.05    36.50   11173    41189000
2001-09-21     6005191  36.28  36.06    36.60    36.00    7879    28638000
2001-09-24     6005191  36.06  36.05    36.39    36.00    4068    14703000
2001-09-25     6005191  36.28  36.23    36.54    36.05    3488    12639000
2001-09-26     6005191  36.11  36.08    36.48    36.00    4956    17892000
2001-09-27     6005191  36.08  36.70    36.98    36.00    8778    32085000
2001-09-28     6005191  36.90  37.09    37.20    36.50   17088    63169000
2001-10-08     6005191  37.00  36.58    37.18    36.25    6552    24091000

In [22]:
c1=贵州茅台.open < 35
c2=贵州茅台.close < 35
布尔列表=c1&c2
贵州茅台.loc[布尔列表]

            STOCK_CODE   open  close  maximum  minimum  volume   TURNOVER
day
2001-10-17     6005191  34.79  34.20    34.81    33.90   12507   42766000
2001-10-18     6005191  34.20  34.04    34.66    33.91    4983   16999000
2001-10-19     6005191  34.00  33.50    34.15    33.01   15687   52422000
2001-10-22     6005191  33.30  32.79    33.70    32.70    9760   32268000
2001-11-08     6005191  33.35  33.70    33.89    32.98    7402   24682000
...                ...    ...    ...      ...      ...     ...        ...
2004-09-21     6005191  32.09  32.30    32.98    32.09    8374   27222818
2004-09-22     6005191  32.03  32.16    32.49    32.03    4348   13965168
2004-09-23     6005191  32.11  33.42    33.52    32.11   17667   58219692
2004-09-24     6005191  33.60  34.49    35.89    33.60   30981  108295826
2004-09-27     6005191  34.95  34.93    35.98    34.50    6067   21339456

[498 rows x 7 columns]

In [23]:
#使用函数作为索引
def condition(pd):
    c1 = pd['open'] < 35
    c2 = pd['close'] < 35
    布尔列表 = c1 & c2
    return  布尔列表

In [24]:
贵州茅台.query('open<35 and close<35')[['open','close']]

             open  close
day
2001-10-17  34.79  34.20
2001-10-18  34.20  34.04
2001-10-19  34.00  33.50
2001-10-22  33.30  32.79
2001-11-08  33.35  33.70
...           ...    ...
2004-09-21  32.09  32.30
2004-09-22  32.03  32.16
2004-09-23  32.11  33.42
2004-09-24  33.60  34.49
2004-09-27  34.95  34.93

[498 rows x 2 columns]

In [25]:
贵州茅台.sample(10)

            STOCK_CODE    open   close  maximum  minimum  volume    TURNOVER
day
2007-09-28     6005191  145.98  150.47   152.60   145.52   26937   406110736
2016-01-13     6005191  199.10  199.78   206.00   198.60   29202   592420624
2017-08-22     6005191  487.40  487.22   489.48   476.00   42457  2051271360
2013-03-25     6005191  169.00  169.03   170.77   168.10   31966   541959904
2007-06-25     6005191  120.10  119.09   124.51   118.50   32757   398355120
2013-08-30     6005191  168.48  168.78   169.00   167.55   25861   435606368
2010-11-12     6005191  175.55  177.53   188.08   175.52  126500  2298576160
2010-01-12     6005191  161.45  165.65   166.17   160.61   31063   509373872
2014-05-28     6005191  152.89  153.94   155.00   152.80   12502   192903907
2017-12-08     6005191  615.42  627.28   628.85   615.42   45503  2842464432

In [26]:
贵州茅台.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4094 entries, 2001-08-27 to 2018-11-02
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   STOCK_CODE  4094 non-null   int64
 1   open        4094 non-null   float64
 2   close       4094 non-null   float64
 3   maximum     4094 non-null   float64
 4   minimum     4094 non-null   float64
 5   volume      4094 non-null   int64
 6   TURNOVER    4094 non-null   int64
dtypes: float64(4), int64(3)
memory usage: 384.9+ KB

In [27]:
贵州茅台.describe

<bound method NDFrame.describe of             STOCK_CODE    open   close  maximum  minimum  volume     TURNOVER
day
2001-08-27     6005191   34.51   35.55    37.78    32.85  406318   1410347008
2001-08-28     6005191   34.99   36.86    37.00    34.61  129647    463463008
2001-08-29     6005191   36.98   36.38    37.00    36.10   53252    194689000
2001-08-30     6005191   36.28   37.10    37.51    36.00   48013    177558000
2001-08-31     6005191   37.15   37.01    37.62    36.80   23231     86231000
...                ...     ...     ...      ...      ...     ...          ...
2018-10-29     6005191  549.09  549.09   549.09   549.09   49076   2694714080
2018-10-30     6005191  510.00  524.00   543.00   509.02  204397  10663392512
2018-10-31     6005191  527.00  548.90   555.00   522.00   96885   5239853056
2018-11-01     6005191  555.00  563.00   585.50   551.25   98107   5581027328
2018-11-02     6005191  585.00  599.90   600.00   572.24   89157   5227695104

[4094 rows x 7 columns]>

In [28]:
result = 贵州茅台['open'].unique()

In [29]:
result2 = 贵州茅台['open'].nunique()

In [30]:
result3 = 贵州茅台['open'].value_counts()

In [31]:
import pandas as pd

In [32]:
df = pd.DataFrame({
    "name": ["A", "B", "C", "B", "C", "A", "C"],
    "value": [1, 3, 7, 2, 4, 3, 1]
    })
df.groupby("name")["value"].sum()

name
A     4
B     5
C    12
Name: value, dtype: int64